#include <stdio.h>
#include <string.h>

#define N 500001
#define M 1000000001
typedef long long ll;
ll num[N];
char sign[N];

int main(void)
{
	int n, f = 0, r = M, i;
	ll ans = 0;
	
	scanf("%d", &n);
	for (i = 0; i < n; i++)
		scanf("%d %c", &num[i], &sign[i]);
	
	for (i = n-1; i >= 0; i--)
	{
		if (f <= num[i] && num[i] <= r) {
			ans += num[i];
		}
		
		if (sign[i] == '+' ) {
			if (num[i] < r) r = num[i];
		} else { // sign[i] == '-'
			if (num[i] > f) f = num[i];
		}
		if (f > r) break;
	}
	
	printf("%lld", ans);
	return 0;
}

/* 题解
本题利用了保留区间的思想，同时这也是离线问题，可以得到所有数据输入后再统一输出结果。
=============================================================================== 
                 正序                     |           逆序                    | 
 ------------------------------------------------------------------------------ 
|删除 | 和前面操作有关，不依赖下面的操作  | 无法删除，前面的元素未知          | 
----------------------- ------------------------------------------------------- 
|保留 | 无法保留，后面的元素未知          | 和后面操作有关，不依赖前面的操作  | 
------------------------------------------------------------------------------- 
*/ 
 
 
 
